# Запис/читання списку випадкових чисел
# 1. Підключити модуль random
import random

# 2. Створити список з 10 випадкових чисел
i = 0
lst = []
while i<10:
    number = random.randint(0, 101) # число від 0 до 100
    lst = lst + [number]
    i = i+1

print("lst = ", lst)

# 3. Зберегти список у текстовому файлі
# 3.1. Відкрити файл для запису
f = open('file.txt', 'wt')

# 3.2. Записати кількість елементів у списку
s = str(len(lst)) # Конвертувати ціле число в рядок
f.write(s + '\n') # Записати рядок

# 3.3. Записати кожен елемент
for i in lst:
    s = str(i) # конвертувати елемент списку в рядок
    f.write(s + ' ') # записати числа в рядок

# 4. Закрити файл
f.close()

# -------------------------------------------
# 5. Читання з файлу 'file.txt'
f = open('file.txt', 'r')

# 6. Прочитати з файлу числа і сформувати список
# 6.1. Прочитати кількість елементів у списку,
# спочатку читається рядок, потім цей рядок
# конвертується в ціле число методом int()
s = f.readline()
n = int(s)

# 6.2. Створити пустий список
lst2 = []

# 6.3. Реалізувати обхід файлу по рядкам і зчитати числа.
# Для читання рядків використовується ітератор файлу.
for line in f:
    # метод split - розбиває на слова на основі символів побіл
    strs = line.split(' ') # отримати масив рядків strs

    # Вивести strs для контролю
    print("strs = ", strs)

    # прочитати усі слова і записати їх в список як цілі числа
    for s in strs:
        if s!='':
            lst2 = lst2 + [int(s)] # додати число до списку

# 6.4. Вивести результат для контролю
print("n = ", len(lst2))
print("lst2 = ", lst2)

# 6.5. Закрити файл - необов'язково
f.close()